  ### Deployment Results ✅

  **jcetina** successfully deployed branch `jcetina/add-firewall` to **production**

  <details><summary>Show Results</summary>

  ```terraform
[command]/home/runner/work/_temp/743ab6b0-8add-48b9-a594-197417596c25/terraform-bin apply -no-color -auto-approve -compact-warnings
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

# module.eastus2-firewall.azurerm_firewall.firewall will be created
+ resource "azurerm_firewall" "firewall" {
    + id                  = (known after apply)
    + location            = "eastus2"
    + name                = "eastus2-firewall"
    + resource_group_name = "org-jcetina-repo-baklava-rg"
    + sku_name            = "AZFW_VNet"
    + sku_tier            = "Standard"
    + threat_intel_mode   = (known after apply)
    + zones               = [
        + "1",
        + "2",
        + "3",
      ]

    + ip_configuration {
        + name                 = "configuration"
        + private_ip_address   = (known after apply)
        + public_ip_address_id = (known after apply)
        + subnet_id            = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-eastus2/subnets/AzureFirewallSubnet"
      }
  }

# module.eastus2-firewall.azurerm_firewall_policy.policy will be created
+ resource "azurerm_firewall_policy" "policy" {
    + child_policies           = (known after apply)
    + firewalls                = (known after apply)
    + id                       = (known after apply)
    + location                 = "eastus2"
    + name                     = "eastus2-firewall-policy"
    + resource_group_name      = "org-jcetina-repo-baklava-rg"
    + rule_collection_groups   = (known after apply)
    + sku                      = (known after apply)
    + threat_intelligence_mode = "Alert"
  }

# module.eastus2-firewall.azurerm_public_ip.firewall_ip will be created
+ resource "azurerm_public_ip" "firewall_ip" {
    + allocation_method       = "Static"
    + fqdn                    = (known after apply)
    + id                      = (known after apply)
    + idle_timeout_in_minutes = 4
    + ip_address              = (known after apply)
    + ip_version              = "IPv4"
    + location                = "eastus2"
    + name                    = "eastus2-firewall-pip"
    + resource_group_name     = "org-jcetina-repo-baklava-rg"
    + sku                     = "Standard"
    + sku_tier                = "Regional"
    + zones                   = [
        + "1",
        + "2",
        + "3",
      ]
  }

Plan: 3 to add, 0 to change, 0 to destroy.
module.eastus2-firewall.azurerm_firewall_policy.policy: Creating...
module.eastus2-firewall.azurerm_public_ip.firewall_ip: Creating...
module.eastus2-firewall.azurerm_public_ip.firewall_ip: Creation complete after 3s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/publicIPAddresses/eastus2-firewall-pip]
module.eastus2-firewall.azurerm_firewall.firewall: Creating...
module.eastus2-firewall.azurerm_firewall_policy.policy: Still creating... [10s elapsed]
module.eastus2-firewall.azurerm_firewall_policy.policy: Creation complete after 13s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/firewallPolicies/eastus2-firewall-policy]
module.eastus2-firewall.azurerm_firewall.firewall: Still creating... [10s elapsed]
module.eastus2-firewall.azurerm_firewall.firewall: Still creating... [20s elapsed]
module.eastus2-firewall.azurerm_firewall.firewall: Still creating... [30s elapsed]
module.eastus2-firewall.azurerm_firewall.firewall: Still creating... [40s elapsed]
module.eastus2-firewall.azurerm_firewall.firewall: Still creating... [50s elapsed]
module.eastus2-firewall.azurerm_firewall.firewall: Still creating... [1m0s elapsed]
module.eastus2-firewall.azurerm_firewall.firewall: Still creating... [1m10s elapsed]
module.eastus2-firewall.azurerm_firewall.firewall: Still creating... [1m20s elapsed]
module.eastus2-firewall.azurerm_firewall.firewall: Still creating... [1m30s elapsed]
module.eastus2-firewall.azurerm_firewall.firewall: Still creating... [1m40s elapsed]
module.eastus2-firewall.azurerm_firewall.firewall: Still creating... [1m50s elapsed]
module.eastus2-firewall.azurerm_firewall.firewall: Still creating... [2m0s elapsed]
module.eastus2-firewall.azurerm_firewall.firewall: Still creating... [2m10s elapsed]
module.eastus2-firewall.azurerm_firewall.firewall: Still creating... [2m20s elapsed]
module.eastus2-firewall.azurerm_firewall.firewall: Creation complete after 2m24s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/azureFirewalls/eastus2-firewall]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
```

  </details>